src/Configuration/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Configuration/CommonModules/ПроверкаТипаКонтрагента/Ext/Module.bsl
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик, Получатель = Неопределено) Экспорт	
	

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("Плательщик", Плательщик);
Запрос.Текст = "ВЫБРАТЬ
|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
|    Контрагенты.Ссылка КАК Контрагент
|ИЗ
|    Справочник.Контрагенты КАК Контрагенты
|ГДЕ
|    Контрагенты.Ссылка = &Плательщик";

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();

Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
	И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
	возврат Ложь;
Иначе
	возврат Истина;
КонецЕсли;
КонецФункции 

фУНКЦИЯ НайтиПоставщика(Поставщик) Экспорт
	
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.ТипКонтрагента = &ТипКонтрагента";
	
		Запрос.УстановитьПараметр("ТипКонтрагента", Перечисления.ТипыКонтрагентов.Поставщик);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
